html>
<head>
<meta charset="utf-8">
<title>Random Number</title>
</head>
<body>
  <table width="800" align="center" border="1">
<?php
//แก้ไขครั้งที่1 ผลลัพธ์ยังไม่ได้ต้องเปลี่ยนหลักการใหม่
  $check = 1;
  $array = ["1","2","3","4","5","6","7","8","9","10"
            ,"11","12","13","14","15","16","17","18","19","20"
            ,"21","22","23","24","25","26","27","28","29","30"
            ,"31","32","33","34","35","36","37","38","39","40"
            ,"41","42","43","44","45","46","47","48","49","50"
            ,"51","52"];
  do{
    $random = rand(1,52);
    $temp;
    $r = 0;
    $c = 0;
    for($i=0;$i<52;$i++)
    {
      if($random == $array[$i])
      {
        $temp = $random;
        $array[$i] = 0;
        break;
      }
      elseif($random != $array[$i])
      {
      }
    }

    if($r!=13 && $c!=4)
    {
      if($c < 4)
      {
        if($r < 13)
        {
          $sum[$r][$c] = $temp;
          $c++;
          if($c == 4)
          {
            $c = 0;
            $r++;
          }
        }
      }
      $check = 1;
    }
    ////////////////////////////////////////////////////////
    elseif($r==13 && $c==4)
    {
      for($i=0; $i<13; $i++)
      {
        for($j=0; $j<4; $j++)
        {
          echo "<td><center>$sum[$i][$j]</center></td>";
        }
      }
      $check = 0;
    }
    //////////////////////////////////////////////////////
  }while($check == 1);
 ?>
</table>
</body>
</html>
